# Создать телефонный справочник с возможностью импорта и экспорта данных в нескольких форматах.

import view as v

print('\nПривет Пользователь!')
v.select_menu()